app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "content", "regist_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["content", "bbdsafdasf"], ["regist_date", "2015-06-30"], ["created_at", "2015-06-30 03:00:59.256028"], ["updated_at", "2015-06-30 03:00:59.256028"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "regist_date" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["regist_date", "2015-07-01"], ["updated_at", "2015-06-30 03:28:16.369661"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)