app/controllers/users_controller.rb

UPDATE "users" SET "email" = ? WHERE "users"."id" = ?  [["email", "maeken0405@hotmail.coma"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)